# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [8]:
# Your code here
cur.execute("""
SELECT firstName,lastName,city,state
FROM employees
LEFT JOIN offices
USING (officeCode)
ORDER BY firstName
""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   firstName   lastName           city       state
0       Andy     Fixter         Sydney
1    Anthony        Bow  San Francisco          CA
2      Barry      Jones         London
3      Diane     Murphy  San Francisco          CA
4   Foon Yue      Tseng            NYC          NY
5     George     Vanauf            NYC          NY
6     Gerard     Bondur          Paris
7     Gerard  Hernandez          Paris
8       Jeff   Firrelli  San Francisco          CA
9      Julie   Firrelli         Boston          MA
10     Larry       Bott         London
11    Leslie   Jennings  San Francisco          CA
12    Leslie   Thompson  San Francisco          CA
13      Loui     Bondur          Paris
14      Mami      Nishi          Tokyo  Chiyoda-Ku
15    Martin     Gerard          Paris
16      Mary  Patterson  San Francisco          CA
17    Pamela   Castillo          Paris
18     Peter      Marsh         Sydney
19     Steve  Patterson         Boston          MA
20       Tom       King         Sydney
21   William  Patterson         Sydney
22   Yoshimi       Kato          Tokyo  Chiyoda-Ku

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [11]:
# Your code here
cur.execute("""
SELECT customerName,contactFirstName,contactLastName,orderNumber, orderDate,status
FROM customers
LEFT JOIN orders
USING (customerNumber)
ORDER BY customerName
""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

,customerName,contactFirstName,contactLastName,orderNumber,orderDate,status
0,ANG Resellers,Alejandra,Camino,NaN,None,None
1,"AV Stores, Co.",Rachel,Ashworth,10110.0,2003-03-18,Shipped
2,"AV Stores, Co.",Rachel,Ashworth,10306.0,2004-10-14,Shipped
3,"AV Stores, Co.",Rachel,Ashworth,10332.0,2004-11-17,Shipped
4,Alpha Cognac,Annette,Roulet,10136.0,2003-07-04,Shipped
...,...,...,...,...,...,...
345,Warburg Exchange,Sven,Ottlieb,NaN,None,None
346,West Coast Collectables Co.,Steve,Thompson,10199.0,2003-12-01,Shipped
347,West Coast Collectables Co.,Steve,Thompson,10215.0,2004-01-29,Shipped
348,giftsbymail.co.uk,Helen,Bennett,10232.0,2004-03-20,Shipped
349,giftsbymail.co.uk,Helen,Bennett,10316.0,2004-11-01,Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [ ]:
# Your code here
cur.execute("""
SELECT contactFirstName,contactLastName,
FROM customers
LEFT JOIN orders
USING (customerNumber)
ORDER BY customerName
""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [ ]:
# Your code here

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!